package com.dengxq.lnglat2Geo

import com.dengxq.lnglat2Geo.utils.AdminUtils
import org.junit.runner.RunWith
import org.scalatest.FlatSpec
import org.scalatest.junit.JUnitRunner

@RunWith(classOf[JUnitRunner])
class AdminNationTest extends FlatSpec {

  val testSource1 = Array(
    "襄樊市","恩施州","昌吉回族自治州","海北藏族自治州","克孜勒苏柯尔克孜自治州","文山壮族苗族自治州","海西蒙古族藏族自治州","海南藏族自治州","博尔塔拉蒙古自治州","西双版纳傣族自治州","玉树藏族自治州","果洛藏族自治州","怒江傈僳族自治州","迪庆藏族自治州","楚雄彝族自治州","大理白族自治州","德宏傣族景颇族自治州","黄南藏族自治州","湘西土家族苗族自治州","伊犁哈萨克自治州","延边朝鲜族自治州","红河哈尼族彝族自治州","黔西南布依族苗族自治州","恩施土家族苗族自治州","黔南布依族苗族自治州","临夏回族自治州","甘孜藏族自治州","黔东南苗族侗族自治州","凉山彝族自治州","甘南藏族自治州","阿坝藏族羌族自治州","巴音郭楞蒙古自治州"
  )
  val testResult1 = Array(
    "襄阳","恩施","昌吉","海北","克孜勒苏","文山","海西","海南","博尔塔拉","西双版纳","玉树","果洛","怒江","迪庆","楚雄","大理","德宏","黄南","湘西","伊犁","延边","红河","黔西南","恩施","黔南","临夏","甘孜","黔东南","凉山","甘南","阿坝"
  )

  val testSource2 = Array(
    "嘉模堂区","新竹县","嘉义市","风顺堂区","花王堂区","云林县","台北市","望德堂区","圣方济各堂区","屏东县","南投县","桃园县","花地玛堂区","台中市","大堂区","新竹市","基隆市","彰化县","苗栗县","台南市","台东县","宜兰县","澎湖县","嘉义县","路凼填海区","花莲县","高雄市","新北市","三沙市","昆玉市","铁门关市","湾仔区","油尖旺区","中西区","双河市","东区","观塘区","九龙城区","屯门区","深水埗区","黄大仙区","葵青区","南区","荃湾区","沙田区","大埔区","西贡区","海口市","东沙群岛","可克达拉市","舟山市","珠海市","拉萨市","阳泉市","长治市","三亚市","运城市","山南市","盘锦市","临汾市","汕头市","忻州市","银川市","克拉玛依市","哈密市","石嘴山市","晋中市","乌鲁木齐市","朔州市","林芝市","吕梁市","上海城区","昌吉回族自治州","鞍山市","潮州市","阿克苏地区","苏州市","吐鲁番市","深圳市","连云港市","晋城市","邯郸市","海北藏族自治州","本溪市","昌都市","大同市","揭阳市","日喀则市","石家庄市","大兴安岭地区","临沧市","韶关市","那曲地区","和田地区","辽阳市","克孜勒苏柯尔克孜自治州","文山壮族苗族自治州","阿勒泰地区","邢台市","太原市","营口市","南通市","衡水市","鄂州市","鹤岗市","海西蒙古族藏族自治州","海南藏族自治州","大庆市","盐城市","博尔塔拉蒙古自治州","七台河市","莱芜市","葫芦岛市","泰州市","松原市","东营市","白城市","西双版纳傣族自治州","昆明市","抚顺市","玉树藏族自治州","阿里地区","枣庄市","锦州市","保山市","黄石市","宿迁市","西宁市","果洛藏族自治州","无锡市","扬州市","徐州市","海东市","随州市","大连市","肇庆市","沧州市","淮安市","丹东市","广州市","河源市","汕尾市","朝阳市","普洱市","厦门市","秦皇岛市","白山市","宁波市","阜新市","丽江市","伊春市","怒江傈僳族自治州","菏泽市","濮阳市","四平市","威海市","江门市","孝感市","聊城市","迪庆藏族自治州","鸡西市","楚雄彝族自治州","廊坊市","云浮市","鹤壁市","温州市","张家界市","大理白族自治州","镇江市","景德镇市","铁岭市","株洲市","泰安市","吴忠市","德宏傣族景颇族自治州","黄南藏族自治州","萍乡市","漯河市","惠州市","齐齐哈尔市","梅州市","唐山市","中卫市","塔城地区","清远市","台州市","黑河市","淮北市","铜陵市","淮南市","佛山市","莆田市","阳江市","烟台市","湖州市","周口市","玉溪市","娄底市","漳州市","淄博市","滨州市","永州市","常州市","嘉兴市","新余市","潍坊市","安庆市","承德市","济南市","南昌市","喀什地区","咸宁市","九江市","通化市","鹰潭市","临沂市","双鸭山市","湘西土家族苗族自治州","济宁市","保定市","德州市","北海市","固原市","荆门市","商丘市","衡阳市","伊犁哈萨克自治州","湘潭市","焦作市","泉州市","十堰市","新乡市","哈尔滨市","日照市","延边朝鲜族自治州","曲靖市","宜昌市","辽源市","天津城区","亳州市","合肥市","抚州市","安阳市","西安市","衢州市","郴州市","蚌埠市","宿州市","芜湖市","牡丹江市","岳阳市","襄阳市","黄山市","昭通市","荆州市","宜春市","黄冈市","红河哈尼族彝族自治州","南京市","咸阳市","绍兴市","阜阳市","安顺市","开封市","吉安市","池州市","绥化市","许昌市","宝鸡市","六安市","益阳市","张家口市","平顶山市","黔西南布依族苗族自治州","常德市","龙岩市","郑州市","驻马店市","铜川市","马鞍山市","防城港市","湛江市","赣州市","沈阳市","上饶市","南平市","恩施土家族苗族自治州","渭南市","佳木斯市","金华市","邵阳市","长春市","南阳市","三门峡市","桂林市","黔南布依族苗族自治州","长沙市","安康市","延安市","武汉市","六盘水市","吉林市","商洛市","福州市","贺州市","北京城区","青岛市","信阳市","洛阳市","三明市","柳州市","丽水市","雅安市","崇左市","宣城市","金昌市","滁州市","汉中市","怀化市","贵港市","贵阳市","梧州市","钦州市","遵义市","攀枝花市","茂名市","南宁市","杭州市","玉林市","眉山市","河池市","张掖市","乐山市","临夏回族自治州","白银市","武威市","天水市","百色市","成都市","来宾市","乌海市","甘孜藏族自治州","巴中市","毕节市","黔东南苗族侗族自治州","酒泉市","榆林市","凉山彝族自治州","内江市","遂宁市","铜仁市","德阳市","陇南市","广元市","宜宾市","资阳市","绵阳市","甘南藏族自治州","巴彦淖尔市","广安市","定西市","阿坝藏族羌族自治州","庆阳市","泸州市","平凉市","巴音郭楞蒙古自治州","自贡市","重庆城区","呼和浩特市","包头市","兰州市","宁德市","南充市","达州市","通辽市","阿拉善盟","兴安盟","锡林郭勒盟","重庆郊县","赤峰市","乌兰察布市","鄂尔多斯市","呼伦贝尔市"
  )
  //  val sparkConf = new SparkConf()
  //    .setAppName("test")
  //    .setMaster("local[2]")
  //    .setKryo()
  //
  //  val sparkContext = new SparkContext(sparkConf)


  "zi zhi zhou in scala " should "success" in {
    testSource1.zip(testResult1).foreach {
      case(s,r) =>
        val a = AdminUtils.shortCityImp(s)._1
        println(s"$s -> $a")
        assert(a == r)
    }
  }

  "shortCity in scala " should "success" in {
    AdminUtils.shortCity("嘉模堂区")
    testSource2.zip(testSource2).foreach {
      case(s,r) =>
        val a = AdminUtils.shortCityImp(s)
        println(s"$s -> $a")
        //assert(a == r)
    }
  }

  "shortDistrict in scala " should "success" in {
//    AdminDataProvider.DistrictLoader.loadChina.children.flatMap(_.children.flatMap(_.children)).foreach{x=>
//      val res = AdminUtils.shortDistrictImp(x.name)
//      println(s"${x.name} -> ${res._1}, ${res._2}")
//    }
  }

  "shortStreet in scala " should "success" in {
//    AdminDataProvider.StreetLoader.loadChinaStreetData.data.flatMap(_._2).foreach{x=>
//      val res = AdminUtils.shortStreetImp(x.name)
//      println(s"${x.name} -> ${res._1}, ${res._2}")
//    }
  }
}
